# Working with columns

### Introduction

In the last lesson, we learned about selecting loading in data with a pandas dataframe, and learning about the datatypes of dataframe, series, and index.  In this lesson, we'll dig further into selecting *columns* -- after all this is a lot of what we'll do in pandas.  

For example, there are many columns that we simply don't need, and then there are other columns that we may want to explore more closely.  Ok, let's see this.

### Exploring Columns

We'll start by loading up our data once again.

In [3]:
import pandas as pd
url = 'houston_claims.csv'
df = pd.read_csv(url, index_col = 0)
df[:1]

,reportedCity,dateOfLoss,elevatedBuildingIndicator,floodZone,latitude,longitude,lowestFloodElevation,amountPaidOnBuildingClaim,amountPaidOnContentsClaim,yearofLoss,reportedZipcode,id
0,HOUSTON,2017-08-27T00:00:00.000Z,False,X,29.7,-95.5,NaN,195857.43,0.0,2017-01-01T00:00:00.000Z,77096,5e398d6774cbd479fc898dea

Now we can use the `columns` method to see a list of all of the columns in our dataframe.

In [4]:
df.columns

Index(['reportedCity', 'dateOfLoss', 'elevatedBuildingIndicator', 'floodZone',
       'latitude', 'longitude', 'lowestFloodElevation',
       'amountPaidOnBuildingClaim', 'amountPaidOnContentsClaim', 'yearofLoss',
       'reportedZipcode', 'id'],
      dtype='object')

### Selecting a single column

And from there, we can see a specific column, by using the bracket accessors `[]`.

In [5]:
df['dateOfLoss']

0        2017-08-27T00:00:00.000Z
1        2008-09-12T00:00:00.000Z
2        2004-06-29T00:00:00.000Z
3        2009-04-28T00:00:00.000Z
4        2001-06-09T00:00:00.000Z
                   ...
19995    2017-08-26T00:00:00.000Z
19996    2015-05-26T00:00:00.000Z
19997    2017-08-27T00:00:00.000Z
19998    2016-04-18T00:00:00.000Z
19999    2017-08-26T00:00:00.000Z
Name: dateOfLoss, Length: 20000, dtype: object

Ok, so we just saw that we can select a column with our bracket accessors.  Another way to select a specific column is with the dot notation and the name of the column.

In [6]:
df.dateOfLoss

0        2017-08-27T00:00:00.000Z
1        2008-09-12T00:00:00.000Z
2        2004-06-29T00:00:00.000Z
3        2009-04-28T00:00:00.000Z
4        2001-06-09T00:00:00.000Z
                   ...
19995    2017-08-26T00:00:00.000Z
19996    2015-05-26T00:00:00.000Z
19997    2017-08-27T00:00:00.000Z
19998    2016-04-18T00:00:00.000Z
19999    2017-08-26T00:00:00.000Z
Name: dateOfLoss, Length: 20000, dtype: object

Now we oftentimes, we will want to hold onto a column by assigning a selected column to a variable.  Let's assign the column `amountPaidOnBuildingClaim` to the variable `building_amount`.

In [7]:
building_amount = None

### Selecting mulitple columns

Now let's move onto selecting multiple columns.  Once again, we'll start by looking at all of our columns.

In [8]:
df.columns

Index(['reportedCity', 'dateOfLoss', 'elevatedBuildingIndicator', 'floodZone',
       'latitude', 'longitude', 'lowestFloodElevation',
       'amountPaidOnBuildingClaim', 'amountPaidOnContentsClaim', 'yearofLoss',
       'reportedZipcode', 'id'],
      dtype='object')

And now let's select use the bracket accessors to select the columns `latitude` and `longitude` and `amountPaidOnBuildingClaim`.

In [12]:
columns = ['latitude', 'longitude', 'amountPaidOnBuildingClaim']
selected_df = df[columns]
selected_df[:3]

   latitude  longitude  amountPaidOnBuildingClaim
0      29.7      -95.5                  195857.43
1      29.5      -95.1                       0.00
2      29.8      -95.6                    1420.89

So we just greatly reduced the number of columns, and assigned this smaller dataframe to `selected_df`.  Let's go over how we did this.

We used the following format:

* dataframe, bracket accessors, list of columns

```python
df[ ['col_1', 'col_2']]
```

It can be hard to keep track of all of those brackets, so it is nice to first assign the list of columns to a variable.

In [11]:
columns = ['latitude', 'longitude', 'amountPaidOnBuildingClaim']
selected_df = df[columns]
selected_df[:3]

   latitude  longitude  amountPaidOnBuildingClaim
0      29.7      -95.5                  195857.43
1      29.5      -95.1                       0.00
2      29.8      -95.6                    1420.89

Notice that if we select a single column from a dataframe, we are working with a series.

In [13]:
type(df['amountPaidOnBuildingClaim'])

pandas.core.series.Series

But if we select multiple columns from a dataframe, we have a dataframe.

In [14]:
type(df[['latitude', 'longitude']])

pandas.core.frame.DataFrame

### Dropping Columns

Just like we can select columns, we can also drop columns.

> Let's load up our data again.

In [17]:
import pandas as pd
url = 'houston_claims.csv'
df = pd.read_csv(url, index_col = 0)
df[:2]

,reportedCity,dateOfLoss,elevatedBuildingIndicator,floodZone,latitude,longitude,lowestFloodElevation,amountPaidOnBuildingClaim,amountPaidOnContentsClaim,yearofLoss,reportedZipcode,id
0,HOUSTON,2017-08-27T00:00:00.000Z,False,X,29.7,-95.5,NaN,195857.43,0.0,2017-01-01T00:00:00.000Z,77096,5e398d6774cbd479fc898dea
1,HOUSTON,2008-09-12T00:00:00.000Z,False,X,29.5,-95.1,NaN,0.00,0.0,2008-01-01T00:00:00.000Z,77058,5e398d6774cbd479fc898dfc

In [19]:
df.columns

Index(['reportedCity', 'dateOfLoss', 'elevatedBuildingIndicator', 'floodZone',
       'latitude', 'longitude', 'lowestFloodElevation',
       'amountPaidOnBuildingClaim', 'amountPaidOnContentsClaim', 'yearofLoss',
       'reportedZipcode', 'id'],
      dtype='object')

With the `drop` method we can provide a list of columns to drop.  The method returns to us a new dataframe with the specified columns removed.

In [20]:
df_dropped = df.drop(columns = ['reportedCity', 'dateOfLoss', 'elevatedBuildingIndicator'])
df_dropped[:4]

,floodZone,latitude,longitude,lowestFloodElevation,amountPaidOnBuildingClaim,amountPaidOnContentsClaim,yearofLoss,reportedZipcode,id
0,X,29.7,-95.5,NaN,195857.43,0.0,2017-01-01T00:00:00.000Z,77096,5e398d6774cbd479fc898dea
1,X,29.5,-95.1,NaN,0.00,0.0,2008-01-01T00:00:00.000Z,77058,5e398d6774cbd479fc898dfc
2,X,29.8,-95.6,NaN,1420.89,0.0,2004-01-01T00:00:00.000Z,77042,5e398d6774cbd479fc898e4b
3,X,29.8,-95.6,NaN,2019.66,0.0,2009-01-01T00:00:00.000Z,77042,5e398d6774cbd479fc898e4c

### Summary

In this lesson, we learned about how to select columns from our pandas dataframe.  We can start by seeing all of the columns with `columns` method.

In [21]:
df.columns

Index(['reportedCity', 'dateOfLoss', 'elevatedBuildingIndicator', 'floodZone',
       'latitude', 'longitude', 'lowestFloodElevation',
       'amountPaidOnBuildingClaim', 'amountPaidOnContentsClaim', 'yearofLoss',
       'reportedZipcode', 'id'],
      dtype='object')

We can select a single column by either using the bracket accessors or the dot notation, and then assign that column a variable.

In [22]:
loss_date = df['dateOfLoss']

In [24]:
loss_date = df.dateOfLoss

We can select multiple columns by still using the bracket accessors, and then passing through a list of columns that we would like to select.

In [25]:
columns = ['reportedCity', 'dateOfLoss', 'elevatedBuildingIndicator']
selected = df[columns]
selected[:3]

  reportedCity                dateOfLoss elevatedBuildingIndicator
0      HOUSTON  2017-08-27T00:00:00.000Z                     False
1      HOUSTON  2008-09-12T00:00:00.000Z                     False
2      HOUSTON  2004-06-29T00:00:00.000Z                     False

We can also drop multiple columns with the `drop` method.

In [26]:
df_dropped = df.drop(columns = ['reportedCity', 'dateOfLoss', 'elevatedBuildingIndicator'])
df_dropped[:4]

,floodZone,latitude,longitude,lowestFloodElevation,amountPaidOnBuildingClaim,amountPaidOnContentsClaim,yearofLoss,reportedZipcode,id
0,X,29.7,-95.5,NaN,195857.43,0.0,2017-01-01T00:00:00.000Z,77096,5e398d6774cbd479fc898dea
1,X,29.5,-95.1,NaN,0.00,0.0,2008-01-01T00:00:00.000Z,77058,5e398d6774cbd479fc898dfc
2,X,29.8,-95.6,NaN,1420.89,0.0,2004-01-01T00:00:00.000Z,77042,5e398d6774cbd479fc898e4b
3,X,29.8,-95.6,NaN,2019.66,0.0,2009-01-01T00:00:00.000Z,77042,5e398d6774cbd479fc898e4c